Mission-3/app/Models/mahasiswamodel.php

    public function getmahasiswa()
    {
        return $this->findAll();
---
SELECT *
FROM `mahasiswa`

    public function getMahasiswaByNim($nim)
    {
        return $this->where(['nim' => $nim])->first();
---
SELECT *
FROM `mahasiswa`
WHERE `nim` = '241513'
 LIMIT 1

    public function getMahasiswaByUserId($userId)
    {
        // Cari data di tabel mahasiswa
        return $this->where(['user_id' => $userId])->first();
---
SELECT *
FROM `mahasiswa`
WHERE `user_id` = '2'
 LIMIT 1