Mission-3/app/Controllers/CourseController.php

SELECT *
FROM `courses`
---
    public function index()
    {
        // Hanya Admin yang boleh mengakses
        if (session()->get('role') !== 'Admin') {
            return redirect()->to('/');
        }

        $model = new CourseModel();

        $data = [
            'title'   => 'Daftar Mata Kuliah',
            'content' => view('course_index_view', ['courses' => $model->findAll()])
        ];

SELECT *
FROM `courses`
WHERE `courses`.`id` = '1'
---
    public function edit($id = null)
    {
        // Hanya Admin yang boleh mengakses
        if (session()->get('role') !== 'Admin') {
            return redirect()->to('/');
        }

        $model = new CourseModel();
        $courseData = $model->find($id);