Mission-4/app/Models/TakesModel.php

SELECT *
FROM `takes`
JOIN `courses` ON `courses`.`id` = `takes`.`course_id`
WHERE `takes`.`mahasiswa_id` = '2'
---
    public function getEnrolledCourses($mahasiswa_id)
    {
        return $this->db->table('takes')
            ->join('courses', 'courses.id = takes.course_id')
            ->where('takes.mahasiswa_id', $mahasiswa_id)
            ->get()->getResultArray();