Mission-4/app/Controllers/EnrollmentController.php

SELECT *
FROM `takes`
WHERE `mahasiswa_id` = '2'
SELECT *
FROM `courses`
---
    public function index()
    {
        $courseModel = new CourseModel();
        $takesModel = new TakesModel();
        $mahasiswa_id = session()->get('user_id');

        $takenCoursesRaw = $takesModel->where('mahasiswa_id', $mahasiswa_id)->findAll();
        $takenCourseIds = array_column($takenCoursesRaw, 'course_id');

        $data = [
            'title'          => 'Ambil Mata Kuliah',
            'courses'        => $courseModel->findAll(),